Zyed816/STM32/STM32Project/6-4PWMSteeringGear/Hardware/OLED_Hardware.c
#include "stm32f10x.h"
#include "OLED_Font.h"

/*初始化引脚和I2C1*/
void OLED_I2C_Init_H(void)
{
    // STM32F103的I2C1默认引脚为PB6，PB7
	// 设置PB6，PB7为复用开漏输出
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;	// 复用开漏输出
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	// 初始化I2C1
	// 开启I2C1时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
	
	I2C_InitTypeDef I2C_InitStructure;
	I2C_InitStructure.I2C_Ack  = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = 100000;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	I2C_Init(I2C1, &I2C_InitStructure);
	
	I2C_Cmd(I2C1, ENABLE);
}

void OLED_I2C_WriteByte_H(uint8_t ControlByte, uint8_t DataByte)
{
	I2C_GenerateSTART(I2C1, ENABLE);
	while(I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS);
	
	/* OLED 地址：0x3C 左移 1 位后是 0x78 */
	I2C_Send7bitAddress(I2C1, 0x78, I2C_Direction_Transmitter);
	while(I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS);
	
	// I2C1向外设输出控制字
	I2C_SendData(I2C1, ControlByte);
	while(I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS);
	
	// I2C1向外设输出数据字
	I2C_SendData(I2C1, DataByte);
	while(I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS);

	I2C_GenerateSTOP(I2C1, ENABLE);
}	

/**
  * @brief  OLED写命令
  * @param  Command 要写入的命令
  * @retval 无
  */
void OLED_WriteCommand_H(uint8_t Command)
{
    OLED_I2C_WriteByte_H(0x00, Command);
}
/**
  * @brief  OLED写数据
  * @param  Data 要写入的数据
  * @retval 无
  */
void OLED_WriteData_H(uint8_t Data)
{
    OLED_I2C_WriteByte_H(0x40, Data);
}

/**
  * @brief  OLED设置光标位置
  * @param  Y 以左上角为原点，向下方向的坐标，范围：0~7
  * @param  X 以左上角为原点，向右方向的坐标，范围：0~127
  * @retval 无
  */
void OLED_SetCursor_H(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand_H(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand_H(0x10 | ((X & 0xF0) >> 4));	//设置X位置高4位
	OLED_WriteCommand_H(0x00 | (X & 0x0F));			//设置X位置低4位
}

/**
  * @brief  OLED清屏
  * @param  无
  * @retval 无
  */
void OLED_Clear_H(void)
{  
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor_H(j, 0);
		for(i = 0; i < 128; i++)
		{
			OLED_WriteData_H(0x00);
		}
	}
}

/**
  * @brief  OLED显示一个字符
  * @param  Line 行位置，范围：1~4
  * @param  Column 列位置，范围：1~16
  * @param  Char 要显示的一个字符，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowChar_H(uint8_t Line, uint8_t Column, char Char)
{      	
	uint8_t i;
	OLED_SetCursor_H((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData_H(OLED_F8x16[Char - ' '][i]);			//显示上半部分内容
	}
	OLED_SetCursor_H((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData_H(OLED_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
	}
}

/**
  * @brief  OLED显示字符串
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  String 要显示的字符串，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowString_H(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar_H(Line, Column + i, String[i]);
	}
}

/**
  * @brief  OLED次方函数
  * @retval 返回值等于X的Y次方
  */
uint32_t OLED_Pow_H(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

/**
  * @brief  OLED显示数字（十进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~4294967295
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowNum_H(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar_H(Line, Column + i, Number / OLED_Pow_H(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十进制，带符号数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：-2147483648~2147483647
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowSignedNum_H(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar_H(Line, Column, '+');
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar_H(Line, Column, '-');
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar_H(Line, Column + i + 1, Number1 / OLED_Pow_H(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十六进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~0xFFFFFFFF
  * @param  Length 要显示数字的长度，范围：1~8
  * @retval 无
  */
void OLED_ShowHexNum_H(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)							
	{
		SingleNumber = Number / OLED_Pow_H(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar_H(Line, Column + i, SingleNumber + '0');
		}
		else
		{
			OLED_ShowChar_H(Line, Column + i, SingleNumber - 10 + 'A');
		}
	}
}

/**
  * @brief  OLED显示数字（二进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~1111 1111 1111 1111
  * @param  Length 要显示数字的长度，范围：1~16
  * @retval 无
  */
void OLED_ShowBinNum_H(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar_H(Line, Column + i, Number / OLED_Pow_H(2, Length - i - 1) % 2 + '0');
	}
}

/**
  * @brief  OLED初始化
  * @param  无
  * @retval 无
  */
void OLED_Init_H(void)
{
	uint32_t i, j;
	
	for (i = 0; i < 1000; i++)			//上电延时
	{
		for (j = 0; j < 1000; j++);
	}
	
	OLED_I2C_Init_H();			//端口初始化
	
	OLED_WriteCommand_H(0xAE);	//关闭显示
	
	OLED_WriteCommand_H(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand_H(0x80);
	
	OLED_WriteCommand_H(0xA8);	//设置多路复用率
	OLED_WriteCommand_H(0x3F);
	
	OLED_WriteCommand_H(0xD3);	//设置显示偏移
	OLED_WriteCommand_H(0x00);
	
	OLED_WriteCommand_H(0x40);	//设置显示开始行
	
	OLED_WriteCommand_H(0xA1);	//设置左右方向，0xA1正常 0xA0左右反置
	
	OLED_WriteCommand_H(0xC8);	//设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand_H(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand_H(0x12);
	
	OLED_WriteCommand_H(0x81);	//设置对比度控制
	OLED_WriteCommand_H(0xCF);

	OLED_WriteCommand_H(0xD9);	//设置预充电周期
	OLED_WriteCommand_H(0xF1);

	OLED_WriteCommand_H(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand_H(0x30);

	OLED_WriteCommand_H(0xA4);	//设置整个显示打开/关闭

	OLED_WriteCommand_H(0xA6);	//设置正常/倒转显示

	OLED_WriteCommand_H(0x8D);	//设置充电泵
	OLED_WriteCommand_H(0x14);

	OLED_WriteCommand_H(0xAF);	//开启显示
		
	OLED_Clear_H();				//OLED清屏
}
